Revit 2026 API

# PartEdgeConditionOrientation Enumeration

---

Relative orientation of the right/lower and left/upper edge condition profiles.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum PartEdgeConditionOrientation
```
```vb
Public Enumeration PartEdgeConditionOrientation
```
```cpp
public enum class PartEdgeConditionOrientation
```
```fsharp
type PartEdgeConditionOrientation
```

| Member name | Value | Description |
| --- | --- | --- |
| Complement | 0 | Before division gap is applied the left/upper and right/lower profiles coincide and neighboring panels complement each other precisely. |
| Mirrored | 1 | Right/lower profile is obtained by mirroring the left/upper profile with respect to the division line. The division gap is not applied. |
| MirroredAndRotated | 2 | Right/lower profile is obtained first by mirroring the left/upper profile with respect to the division line and then by mirroring the result with respect to the center line of the divided thickness. The division gap is not applied. |

A family-based profile defines the shape of the left/upper profile and this value defines how a matching right/lower profile is obtained.

#### Reference

Autodesk.Revit.DB Namespace